src/cf/Documents/Корреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Корреспонденция</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКорреспонденции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбращенийГраждан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовоКВыгрузкеССТУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонтрагента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПереадресовавшего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеОбращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеОбращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переадресовавший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияПервоначальный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтветаПереадресовавшему</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтветПереадресовавшему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДубликатОбращения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПовторноеОбращение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыОбращения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтвета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВопроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МнениеАвтораОМерах</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МнениеАвтораОРезультатах</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганДляПередачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРассмотрения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыРассмотренияОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТемыОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тематика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТематикиОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Корреспонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Корреспондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтправки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонтрагента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/РаботаСКорреспонденциейВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает реквизиты документа "В ответ на".
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия - ссылка на выбранный документ.
// 
// Возвращаемое значение:
//  ДанныеВОтветНа - Структура - реквизиты документа "В ответ на".
//
Функция ДанныеВОтветНа(Знач Документ) Экспорт 
	
	ДанныеВОтветНа = Новый Структура;
	ДанныеВОтветНа.Вставить("РегистрационныйНомер", "");
	ДанныеВОтветНа.Вставить("ДатаРегистрации", Неопределено);
	ДанныеВОтветНа.Вставить("Заголовок", "");
	ДанныеВОтветНа.Вставить("ВопросДеятельности", Неопределено);
	ДанныеВОтветНа.Вставить("Проект", Неопределено);
	ДанныеВОтветНа.Вставить("Контрагенты", Неопределено);
	ДанныеВОтветНа.Вставить("Контрагент", Неопределено);
	ДанныеВОтветНа.Вставить("Адресат", Неопределено);
	ДанныеВОтветНа.Вставить("НомерКонтрагента", "");
	ДанныеВОтветНа.Вставить("ДатаКонтрагента", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыПредприятия.Ссылка,
		|	ДокументыПредприятия.Заголовок,
		|	ДокументыПредприятия.ДатаРегистрации,
		|	ДокументыПредприятия.РегистрационныйНомер,
		|	Корреспонденция.ДатаКонтрагента,
		|	Корреспонденция.НомерКонтрагента,
		|	ДокументыПредприятия.ВопросДеятельности,
		|	ДокументыПредприятия.Проект,
		|	ДокументыПредприятия.Контрагенты
		|ИЗ
		|	Документ.Корреспонденция КАК Корреспонденция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыПредприятия КАК ДокументыПредприятия
		|		ПО Корреспонденция.Основание = ДокументыПредприятия.Ссылка
		|ГДЕ
		|	ДокументыПредприятия.Ссылка = &Документ";
	Запрос.Параметры.Вставить("Документ", Документ);
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ДанныеВОтветНа;
	КонецЕсли;
	
	ВыборкаДокумент = Результат.Выбрать();
	ВыборкаДокумент.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеВОтветНа, ВыборкаДокумент,, "Контрагенты");
	
	ВыборкаКонтрагент = ВыборкаДокумент.Контрагенты.Выбрать();
	Пока ВыборкаКонтрагент.Следующий() Цикл 
		ДанныеВОтветНа.Вставить("Контрагент", ВыборкаКонтрагент.Контрагент);
		ДанныеВОтветНа.Вставить("Адресат", ВыборкаКонтрагент.КонтактноеЛицо);
		Прервать;
	КонецЦикла;

	Возврат ДанныеВОтветНа;
	
КонецФункции

// Возвращает список значений данных выбора при автоподборе текста.
// 
// Параметры:
//  ВОтветНаСтрока  - Строка - для поиска данных.
//  Контрагенты - Массив - контрагенты для поиска.
//  ТолькоИсходящаяКорреспонденция - Булево - признак выбора исходящей корреспонденции.
// 
// Возвращаемое значение:
//  СписокЗначений - Данные выбора в поле "В ответ на".
//
Функция ДанныеВыбораВОтветНа(Знач ВОтветНаСтрока, Контрагенты, ТолькоИсходящаяКорреспонденция = Ложь) Экспорт 
	
	ДанныеВыбора = Новый СписокЗначений;

	Если Лев(ВОтветНаСтрока, 1) = "№" Тогда
		ВОтветНаСтрока = СокрЛП(Прав(ВОтветНаСтрока, СтрДлина(ВОтветНаСтрока)-1));
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВОтветНаСтрока) Тогда
		Возврат ДанныеВыбора;
	КонецЕсли;
		
	// Заполнение "в ответ на". Поиск по номеру или наименованию
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	ДокументыПредприятия.Ссылка КАК Ссылка,
		|	Корреспонденция.НомерКонтрагента,
		|	Корреспонденция.ДатаКонтрагента,
		|	ДокументыПредприятия.РегистрационныйНомер,
		|	ДокументыПредприятия.ДатаРегистрации,
		|	ДокументыПредприятия.Заголовок
		|ИЗ
		|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументов КАК ВидыДокументов
		|		ПО (ВидыДокументов.Ссылка = ДокументыПредприятия.ВидДокумента)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыПредприятия.Контрагенты КАК ДокументыПредприятияКонтрагенты
		|		ПО (ДокументыПредприятияКонтрагенты.Ссылка = ДокументыПредприятия.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корреспонденция КАК Корреспонденция
		|		ПО (Корреспонденция.Основание = ДокументыПредприятия.Ссылка)
		|ГДЕ
		|	(ДокументыПредприятия.РегистрационныйНомер ПОДОБНО &СтрокаПоиска
		|	ИЛИ ДокументыПредприятия.Заголовок ПОДОБНО &СтрокаПоиска
		|	ИЛИ Корреспонденция.НомерКонтрагента ПОДОБНО &СтрокаПоиска)
		|	И ВидыДокументов.ЯвляетсяИсходящейКорреспонденцией = &ТолькоИсходящаяКорреспонденция
		|	И ВидыДокументов.ЯвляетсяВходящейКорреспонденцией = &ТолькоВходящаяКорреспонденция
		|	И (НЕ &ОтборПоКонтрагентам
		|	ИЛИ ДокументыПредприятияКонтрагенты.Контрагент В (&Контрагенты))";
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ВОтветНаСтрока + "%");
	Запрос.УстановитьПараметр("ОтборПоКонтрагентам", Контрагенты.Количество() > 0);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	
	Если ТолькоИсходящаяКорреспонденция Тогда 
		Запрос.УстановитьПараметр("ТолькоИсходящаяКорреспонденция", Истина);
		Запрос.УстановитьПараметр("ТолькоВходящаяКорреспонденция", Ложь);
		
	Иначе
		Запрос.УстановитьПараметр("ТолькоИсходящаяКорреспонденция", Ложь);
		Запрос.УстановитьПараметр("ТолькоВходящаяКорреспонденция", Истина);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка,
			РаботаСКорреспонденцией.ПредставлениеДокументаКорреспонденции(
				Выборка, НСтр("ru = '№ %1 от %2'"), ТолькоИсходящаяКорреспонденция));
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Возвращает список значений данных выбора при автоподборе текста в поле предмета переписки.
// Ищет по рег. номеру или заголовку.
// 
// Параметры:
//  Текст  - Строка - строка для поиска данных.
// 
// Возвращаемое значение:
//  СписокЗначений - Данные выбора в поле "Предмет переписки".
//
Функция ДанныеВыбораПредметаПереписки(Знач Текст) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;

	Если Лев(Текст, 1) = "№" Тогда
		Текст = СокрЛП(Прав(Текст, СтрДлина(Текст)-1));
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Текст)Тогда
		Возврат ДанныеВыбора;
	КонецЕсли;
		
	// Заполнение "в ответ на". Поиск по номеру или наименованию
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыПредприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументов КАК ВидыДокументов
	|		ПО (ВидыДокументов.Ссылка = ДокументыПредприятия.ВидДокумента)
	|ГДЕ
	|	(ДокументыПредприятия.РегистрационныйНомер ПОДОБНО &СтрокаПоиска
	|			ИЛИ ДокументыПредприятия.Заголовок ПОДОБНО &СтрокаПоиска)
	|	И Не ВидыДокументов.ЯвляетсяИсходящейКорреспонденцией
	|	И Не ВидыДокументов.ЯвляетсяВходящейКорреспонденцией";
	
	Запрос.Параметры.Вставить("СтрокаПоиска", Текст + "%");
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Находит и возвращает ссылку на документ Корреспонденция, принадлежащий переданному владельцу
// Вернет Неопределено, если Корреспонденция не найдена
// 
// Параметры:
//  ДокументВладелец - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  - ДокументСсылка.Корреспонденция, Неопределено
//
Функция КорреспонденцияДокумента(ДокументВладелец) Экспорт
	
	Возврат РаботаСКорреспонденцией.КорреспонденцияДокумента(ДокументВладелец);
	
КонецФункции

#КонецОбласти
